read_liberty sg13g2_stdcell_typ_1p20V_25C.lib
read_verilog synth_out.v
link_design half_adder
read_sdc ha.sdc
report_checks